[
  {
    "narrative_id": "r_0001",
    "text": "I'm F35 and my M31 boyfriend (been together for almost 2 years) took a \\\"break\\\" in December due to our arguments and lack of positive communication. During that time we didn't see each other as often at all. Prior to this break we had never gone a night without each other. However we still talked pretty regularly even if the conversations weren't always pleasant. One day we'd get along pretty well and then 2 days later we'd be back to arguing in circles about the same situations. We had both agreed that we wanted to work on things and be with each other. He would tell me he loved me and missed me and would say that I'm the one. However at the end of March I found out that he had been seeing and sleeping with a 28F for the whole \\\"break\\\" all while occasionally seeing me and sleeping with me. I saw the texts messsges between them and he was telling her he loved her and very emotional and meaningful texts at times. He told me she was just a fuck but if she was just a fuck then why so many compliments and the \\\"I love you\\\"?! I also found him sending women dick pictures and videos of him jacking off on Snapchat and he also messaged women and called women on Facebook. He emotionally and physically cheated on me. He downplayed the relationship with the 28F. They talked on a regular basis and hung out most everyday and she would stay with him. He says that he's \\\" in love\\\" with me and doesn't have any feelings for her. I just don't know what to believe because some of the stuff he texted her was exactly the same stuff he had sent me. I feel broken and insecure now. The amount of women and dirty things I saw was seriously unbelievable. I did not ever think he would do this to me. I didn't do anything to that extreme while on our break. I got a few phone numbers. I was asked out on a date and declined. I never emotionally or physically cheated on him at all. Also all of his family and friends knew about this woman and others. So now I feel uncomfortable and stupid around them. How would you feel? What would you do? I really am in love with him but I don't know how to feel.",
    "source": "reddit",
    "lang": "en",
    "subreddit": "ToxicRelationships"
  },
  {
    "narrative_id": "r_0002",
    "text": "I (35M) have been dating my girlfriend (27F) for a while now, and lately I feel like I'm constantly walking on eggshells around her. One of the recurring issues is how she treats my sense of humor. My friends and family tell me I'm funny, and I've always been able to make people laugh. But with her, if I laugh at something while we're talking, she'll stop and ask, \\\"Why is that funny?\\\" I usually apologize, but then she just won't continue her story. It makes conversations tense and awkward. There's also a pattern of her getting upset over small things. If I leave my shoes out, she screams at me. If I put her clothes away in the \\\"wrong\\\" place, she yells at me. What makes this harder is that she's currently not working, and I'm the one paying all the bills. I don't mind supporting her, but I feel like my efforts aren't being appreciated—instead I'm criticized or snapped at over minor things. I'm starting to question if this is just normal relationship stress or if I'm being treated unfairly. Has anyone been through something like this? How do you even start addressing it? TL;DR: 35M paying all the bills while 27F girlfriend isn't working. She often yells at me for small things (like leaving shoes out or putting clothes in the wrong place) and makes conversations tense by criticizing my sense of humor. Feeling unappreciated and wondering how to address this dynamic.",
    "source": "reddit",
    "lang": "en",
    "subreddit": "ToxicRelationships"
  },
  {
    "narrative_id": "r_0003",
    "text": "(TW! S*x and manipulative behavior) While I was in a relationship with my bf of 1,5 years. He continued to being manipulative and made me feel bad about my choices. He made me feel bad if I told him I didn't want to continue on with having s*x with him. So he kinda threatened me that he will get mad at me if I told him to stop. When we were having our 'sessions' he would force my head down onto the bed and slap me really aggressively on my behind. He made me feel like a disgusting person who was unable to please him. He never made any effort into making me finish either, he said that it's not important for me to finish. I never felt that blissful feeling afterwards, I just felt used and dirty.",
    "source": "reddit",
    "lang": "en",
    "subreddit": "ToxicRelationships"
  }
]